       IDENTIFICATION DIVISION.
       PROGRAM-ID. FINAL-PROJECT.
       AUTHOR. GROUP 5.
       REMARKS. FINAL-PROJECT.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

      *FILE ASSIGNMENT (INPUT AND OUTPUT)
       FILE-CONTROL.
           SELECT SUBJECT-IN ASSIGN TO 'SUBJECT.txt'.
           SELECT FACULTY-IN ASSIGN TO 'FACULTY.txt'.
           SELECT STUDENT-IN ASSIGN TO 'STUDENT.txt'.
           SELECT GRADE-IN ASSIGN TO 'GRADE.txt'.
           SELECT ENROLL-IN ASSIGN TO 'ENROLL.txt'.
           SELECT GRADES-IN ASSIGN TO 'GRADES.txt'.
       DATA DIVISION.
       FILE SECTION.
       FD  SUBJECT-IN
           LABEL RECORD IS STANDARD
           RECORD CONTAINS 40 CHARACTERS
           DATA RECORD IS SUBEJECT-REC.
       01  SUBEJECT-REC.
           05 SUBJECT-CODE PIC X(10).
           05 SUBJECT-DESC PIC X(30).

       FD  FACULTY-IN
           LABEL RECORD IS STANDARD
           RECORD CONTAINS 47 CHARACTERS
           DATA RECORD IS FACULTY-REC.
       01  FACULTY-REC.
           05 CODE-OF-SUBJECT PIC X(10).
           05 ID-OF-FACULTY PIC X(12).
           05 NAME-OF-FACULTY PIC X(25).

       FD  STUDENT-IN
           LABEL RECORD IS STANDARD
           RECORD CONTAINS 59 CHARACTERS
           DATA RECORD IS STUDENT-REC.
       01  STUDENT-REC.
           05 CODE-SUBJECT PIC X(10).
           05 FACULTY-ID PIC X(12).
           05 STUDENT-NUM PIC X(12).
           05 STUDENT-NAME PIC X(25).

       FD  GRADE-IN
           LABEL RECORD IS STANDARD
           RECORD CONTAINS 40 CHARACTERS
           DATA RECORD IS GRADES-REC.
       01  GRADES-REC.
           05 SUBJECTCODE PIC X(10).
           05 FACULTYID PIC X(12).
           05 STUD-NUMBER PIC X(12).
           05 MID-GRADE PIC 9V99.
           05 FIN-GRADE PIC 9V99.

       FD  ENROLL-IN.
       01  ENROLL-OUT.
           05 FILLER PIC X(80).

       FD  GRADES-IN.
       01  GRADES-OUT.
           05 FILLER PIC X(80).

       WORKING-STORAGE SECTION.
      *HEADERS TO USE
       01  HEADER1-ENROLL.
           05 FILLER PIC X(32).
           05 FILLER PIC X(16) VALUE 'TRI-STAR ACADEMY'.
           05 FILLER PIC X(32).

       01  HEADER2-ENROLL.
           05 FILLER PIC X(28).
           05 FILLER PIC X(30) VALUE 'GREENHILLS, SAN JUAN CITY'.
           05 FILLER PIC X(22).

       01  HEADER3-ENROLL.
           05 FILLER PIC X(28).
           05 FILLER PIC X(25) VALUE 'STUDENT ENROLLMENT REPORT'.
           05 FILLER PIC X(27).

       01  HEADER4-ENROLL.
           05 FILLER PIC X(30).
           05 FILLER PIC X(20) VALUE 'STUDENT GRADE REPORT'.
           05 FILLER PIC X(30).

       01  ENROLL-HEADER1.
           05 FILLER PIC X(24) VALUE 'SUBJECT CODE         :  '.
           05 EN-SUBJECT-CODE PIC X(10).

       01  ENROLL-HEADER2.
           05 FILLER PIC X(24) VALUE 'SUBJECT DESCRIPTION  :  '.
           05 EN-SUBJECT-DESC PIC X(30).
           05 FILLER PIC X(26).

       01  ENROLL-HEADER3.
           05 FILLER PIC X(14) VALUE 'STUDENT NUMBER'.
           05 FILLER PIC X(14).
           05 FILLER PIC X(12) VALUE 'STUDENT NAME'.
           05 FILLER PIC X(40).

       01  ENROLL-REC.
           05 NUM-STUDENT PIC X(12).
           05 FILLER PIC X(16).
           05 NAME-STUDENT PIC X(25).
           05 FILLER PIC X(27).

       01  ENROLL-TOTAL-NUM.
           05 FILLER PIC X(24) VALUE 'TOTAL NUMBER OF STUDENTS'.
           05 FILLER PIC X(11) VALUE ' ENROLLED: '.
           05 TOTAL-EN-NUM PIC Z99.
           05 FILLER PIC X(42).

       01  ENROLL-GRANDTOTAL-NUM.
           05 FILLER PIC X(30) VALUE 'GRAND TOTAL NUMBER OF STUDENTS'.
           05 FILLER PIC X(13) VALUE ' ENROLLED:   '.
           05 ENROLL-GT-NUM PIC Z,Z99.
           05 FILLER PIC X(32).

       01  OTHER-FIELDS.
           05 EOF1-EN PIC X(3) VALUE 'NO'.
           05 EOF2-EN PIC X(3) VALUE 'NO'.
           05 EOF3-EN PIC X(3) VALUE 'NO'.
           05 EOF4-EN PIC X(3) VALUE 'NO'.
           05 EOF5-EN PIC X(3) VALUE 'NO'.
           05 EOF6-EN PIC X(3) VALUE 'NO'.
           05 EOF7-EN PIC X(3) VALUE 'NO'.
           05 TOTAL-FIRST PIC 999 VALUE 0.
           05 TOTAL-SECOND PIC 999 VALUE 0.
           05 TOTAL-THIRD PIC 999 VALUE 0.
           05 TOTAL-FOURTH PIC 999 VALUE 0.
           05 TOTAL-FIFTH PIC 999 VALUE 0.
           05 TOTAL-SIXTH PIC 999 VALUE 0.
           05 TOTAL-SEVENTH PIC 999 VALUE 0.
           05 GRAND-TOTAL-ENROLL PIC 9999 VALUE 0.

       01  HEADER1-GRADES.
           05 FILLER PIC X(17) VALUE 'SUBJECT CODE  :  '.
           05 SUB-CODE PIC X(10).
           05 FILLER PIC X(53).

       01  HEADER2-GRADES.
           05 FILLER PIC X(17) VALUE 'FACULTY ID    :  '.
           05 ID-FACULTY PIC X(12).
           05 FILLER PIC X(51).

       01  HEADER3-GRADES.
           05 FILLER PIC X(17) VALUE 'FACULTY NAME  :  '.
           05 NAME-FACULTY PIC X(25).
           05 FILLER PIC X(38).

       01  HEADER4-GRADES.
           05 FILLER PIC X(14) VALUE 'STUDENT NUMBER'.
           05 FILLER PIC X(11).
           05 FILLER PIC X(12) VALUE 'STUDENT NAME'.
           05 FILLER PIC X(16).
           05 FILLER PIC X(13) VALUE 'AVERAGE GRADE'.
           05 FILLER PIC X(7).
           05 FILLER PIC X(7) VALUE 'REMARKS'.

       01  GRADE-REC.
           05 NO-OF-STUDENT PIC X(12).
           05 FILLER PIC X(13).
           05 NA-OF-STUDENT PIC X(25).
           05 FILLER PIC X(3).
           05 AVERAGE-GRADE PIC 9.99.
           05 FILLER PIC X(16).
           05 REMARK PIC X(7).

       01  TOTAL-NUM-OF-PASS.
           05 FILLER PIC X(28) VALUE 'TOTAL NUMBER OF STUDENTS WHO'.
           05 FILLER PIC X(9) VALUE ' PASSED: '.
           05 TOTAL-NUM-PASS PIC Z9.
           05 FILLER PIC X(41).

       01  TOTAL-NUM-OF-FAIL.
           05 FILLER PIC X(28) VALUE 'TOTAL NUMBER OF STUDENTS WHO'.
           05 FILLER PIC X(9) VALUE ' FAILED: '.
           05 TOTAL-NUM-FAIL PIC Z9.
           05 FILLER PIC X(41).

       01  OTHER-FIELDS1.
           05 EOF1-GRADES PIC X(3) VALUE 'NO'.
           05 EOF2-GRADES PIC X(3) VALUE 'YES'.
           05 EOF3-GRADES PIC X(3) VALUE 'NO'.
           05 EOF4-GRADES PIC X(3) VALUE 'YES'.
           05 EOF5-GRADES PIC X(3) VALUE 'NO'.
           05 EOF6-GRADES PIC X(3) VALUE 'YES'.
           05 EOF7-GRADES PIC X(3) VALUE 'NO'.
           05 EOF8-GRADES PIC X(3) VALUE 'YES'.
           05 EOF9-GRADES PIC X(3) VALUE 'NO'.
           05 EOF10-GRADES PIC X(3) VALUE 'YES'.
           05 EOF11-GRADES PIC X(3) VALUE 'NO'.
           05 EOF12-GRADES PIC X(3) VALUE 'YES'.
           05 EOF13-GRADES PIC X(3) VALUE 'NO'.
           05 EOF14-GRADES PIC X(3) VALUE 'YES'.
           05 EOF15-GRADES PIC X(3) VALUE 'NO'.
           05 EOF16-GRADES PIC X(3) VALUE 'YES'.
           05 EOF17-GRADES PIC X(3) VALUE 'NO'.
           05 EOF18-GRADES PIC X(3) VALUE 'YES'.
           05 EOF19-GRADES PIC X(3) VALUE 'NO'.
           05 EOF20-GRADES PIC X(3) VALUE 'YES'.
           05 EOF21-GRADES PIC X(3) VALUE 'NO'.
           05 EOF22-GRADES PIC X(3) VALUE 'YES'.

       01  OTHER-FIELDS2.
           05 AVERAGE-GRD PIC 9V99 VALUE 0.
           05 STUDENT1-PASS PIC 9 VALUE 0.
           05 STUDENT1-FAIL PIC 9 VALUE 0.
           05 STUDENT2-PASS PIC 9 VALUE 0.
           05 STUDENT2-FAIL PIC 9 VALUE 0.
           05 STUDENT3-PASS PIC 9 VALUE 0.
           05 STUDENT3-FAIL PIC 9 VALUE 0.
           05 STUDENT4-PASS PIC 9 VALUE 0.
           05 STUDENT4-FAIL PIC 9 VALUE 0.
           05 STUDENT5-PASS PIC 9 VALUE 0.
           05 STUDENT5-FAIL PIC 9 VALUE 0.
           05 STUDENT6-PASS PIC 9 VALUE 0.
           05 STUDENT6-FAIL PIC 9 VALUE 0.
           05 STUDENT7-PASS PIC 9 VALUE 0.
           05 STUDENT7-FAIL PIC 9 VALUE 0.
           05 STUDENT8-PASS PIC 9 VALUE 0.
           05 STUDENT8-FAIL PIC 9 VALUE 0.
           05 STUDENT9-PASS PIC 9 VALUE 0.
           05 STUDENT9-FAIL PIC 9 VALUE 0.
           05 STUDENT10-PASS PIC 9 VALUE 0.
           05 STUDENT10-FAIL PIC 9 VALUE 0.
           05 STUDENT11-PASS PIC 9 VALUE 0.
           05 STUDENT11-FAIL PIC 9 VALUE 0.

       01  BLNK-HDR.
           05 FILLER PIC X(80).

       SCREEN SECTION.
       01  SCRN.
           05 BLANK SCREEN.

       PROCEDURE DIVISION.
           PERFORM ENROLL-MAIN-RTN.
           PERFORM GRADES-MAIN-RTN.
           DISPLAY 'END OF MERGING PROGRAM!'.
           DISPLAY 'CHECK ENROLL.txt FOR THE OUTPUT'.
           DISPLAY 'CHECK GRADES.txt FOR THE OUTPUT'.
           STOP RUN.

       ENROLL-MAIN-RTN.
           OPEN INPUT SUBJECT-IN
                INPUT STUDENT-IN
                OUTPUT ENROLL-IN.
           DISPLAY SCRN.
           PERFORM ENROLL-WRITE-HEADER.
           PERFORM FIRST-SUBJECT-RTN.
           CLOSE STUDENT-IN.
           OPEN INPUT STUDENT-IN.
           PERFORM SECOND-SUBJECT-RTN.
           CLOSE STUDENT-IN.
           OPEN INPUT STUDENT-IN.
           PERFORM THIRD-SUBJECT-RTN.
           CLOSE STUDENT-IN.
           OPEN INPUT STUDENT-IN.
           PERFORM FOURTH-SUBJECT-RTN.
           CLOSE STUDENT-IN.
           OPEN INPUT STUDENT-IN.
           PERFORM FIFTH-SUBJECT-RTN.
           CLOSE STUDENT-IN.
           OPEN INPUT STUDENT-IN.
           PERFORM SIXTH-SUBJECT-RTN.
           CLOSE STUDENT-IN.
           OPEN INPUT STUDENT-IN.
           PERFORM SEVENTH-SUBJECT-RTN.
           PERFORM FOOTER-IN-RTN.
           CLOSE SUBJECT-IN, STUDENT-IN, ENROLL-IN.

       GRADES-MAIN-RTN.
           OPEN INPUT FACULTY-IN
                INPUT STUDENT-IN
                INPUT GRADE-IN
                OUTPUT GRADES-IN.
           PERFORM GRADES-WRITE-HEADER2.
           PERFORM FIRST-GRADE-RTN.
           CLOSE STUDENT-IN, GRADE-IN.
           OPEN INPUT STUDENT-IN
                INPUT GRADE-IN.
           PERFORM SECOND-GRADE-RTN.
           CLOSE STUDENT-IN, GRADE-IN.
           OPEN INPUT STUDENT-IN
                INPUT GRADE-IN.
           PERFORM THIRD-GRADE-RTN.
           CLOSE STUDENT-IN, GRADE-IN.
           OPEN INPUT STUDENT-IN
                INPUT GRADE-IN.
           PERFORM FOURTH-GRADE-RTN.
           CLOSE STUDENT-IN, GRADE-IN.
           OPEN INPUT STUDENT-IN
                INPUT GRADE-IN.
           PERFORM FIFTH-GRADE-RTN.
           CLOSE STUDENT-IN, GRADE-IN.
           OPEN INPUT STUDENT-IN
                INPUT GRADE-IN.
           PERFORM SIXTH-GRADE-RTN.
           CLOSE STUDENT-IN, GRADE-IN.
           OPEN INPUT STUDENT-IN
                INPUT GRADE-IN.
           PERFORM SEVENTH-GRADE-RTN.
           CLOSE STUDENT-IN, GRADE-IN.
           OPEN INPUT STUDENT-IN
                INPUT GRADE-IN.
           PERFORM EIGHT-GRADE-RTN.
           CLOSE STUDENT-IN, GRADE-IN.
           OPEN INPUT STUDENT-IN
                INPUT GRADE-IN.
           PERFORM NINTH-GRADE-RTN.
           CLOSE STUDENT-IN, GRADE-IN.
           OPEN INPUT STUDENT-IN
                INPUT GRADE-IN.
           PERFORM TENTH-GRADE-RTN.
           CLOSE STUDENT-IN, GRADE-IN.
           OPEN INPUT STUDENT-IN
                INPUT GRADE-IN.
           PERFORM ELEVEN-GRADE-RTN.
           CLOSE FACULTY-IN, STUDENT-IN, GRADE-IN, GRADES-IN.

       ENROLL-WRITE-HEADER.
           WRITE ENROLL-OUT FROM HEADER1-ENROLL.
           WRITE ENROLL-OUT FROM HEADER2-ENROLL.
           WRITE ENROLL-OUT FROM BLNK-HDR AFTER 2.
           WRITE ENROLL-OUT FROM HEADER3-ENROLL.
           WRITE ENROLL-OUT FROM BLNK-HDR AFTER 2.

       ENROLL-MOVE-RTN.
           MOVE SUBJECT-CODE TO EN-SUBJECT-CODE
           MOVE SUBJECT-DESC TO EN-SUBJECT-DESC
           WRITE ENROLL-OUT FROM ENROLL-HEADER1.
           WRITE ENROLL-OUT FROM ENROLL-HEADER2.
           WRITE ENROLL-OUT FROM ENROLL-HEADER3.

       ENROLL-WRITE-RTN.
           WRITE ENROLL-OUT FROM BLNK-HDR.
           WRITE ENROLL-OUT FROM ENROLL-TOTAL-NUM.
           WRITE ENROLL-OUT FROM BLNK-HDR.

       ENROLL-ADD-RTN.
           MOVE STUDENT-NUM TO NUM-STUDENT
           MOVE STUDENT-NAME TO NAME-STUDENT
           ADD 1 TO TOTAL-FIRST
           ADD 1 TO GRAND-TOTAL-ENROLL
           MOVE TOTAL-FIRST TO TOTAL-EN-NUM
           MOVE GRAND-TOTAL-ENROLL TO ENROLL-GT-NUM
           WRITE ENROLL-OUT FROM ENROLL-REC.

       FIRST-SUBJECT-RTN.
           READ SUBJECT-IN.
           IF SUBJECT-CODE = 'IT 2001   '
               PERFORM ENROLL-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF1-EN.
               PERFORM FIRST-COMP-RTN UNTIL EOF1-EN = 'YES'.
               PERFORM ENROLL-WRITE-RTN.
       FIRST-COMP-RTN.
           IF CODE-SUBJECT = SUBJECT-CODE
              PERFORM ENROLL-ADD-RTN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF1-EN.

       SECOND-SUBJECT-RTN.
           READ SUBJECT-IN.
           IF SUBJECT-CODE = 'HIST 1000 '
               PERFORM ENROLL-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF2-EN.
               PERFORM SECOND-COMP-RTN UNTIL EOF2-EN = 'YES'.
               WRITE ENROLL-OUT FROM BLNK-HDR.
               WRITE ENROLL-OUT FROM ENROLL-TOTAL-NUM.
               WRITE ENROLL-OUT FROM BLNK-HDR.
       SECOND-COMP-RTN.
           IF CODE-SUBJECT = SUBJECT-CODE
               PERFORM ENROLL-ADD-RTN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF2-EN.

       THIRD-SUBJECT-RTN.
           READ SUBJECT-IN.
           IF SUBJECT-CODE = 'NATSCI 100'
               PERFORM ENROLL-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF3-EN.
               PERFORM THIRD-COMP-RTN UNTIL EOF3-EN = 'YES'.
               WRITE ENROLL-OUT FROM BLNK-HDR.
               WRITE ENROLL-OUT FROM ENROLL-TOTAL-NUM.
               WRITE ENROLL-OUT FROM BLNK-HDR.
       THIRD-COMP-RTN.
           IF CODE-SUBJECT = SUBJECT-CODE
               PERFORM ENROLL-ADD-RTN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF3-EN.

       FOURTH-SUBJECT-RTN.
           READ SUBJECT-IN.
           IF SUBJECT-CODE = 'NATSCI 105'
               PERFORM ENROLL-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF4-EN.
               PERFORM FOURTH-COMP-RTN UNTIL EOF4-EN = 'YES'.
               WRITE ENROLL-OUT FROM BLNK-HDR.
               WRITE ENROLL-OUT FROM ENROLL-TOTAL-NUM.
               WRITE ENROLL-OUT FROM BLNK-HDR.
       FOURTH-COMP-RTN.
           IF CODE-SUBJECT = SUBJECT-CODE
               PERFORM ENROLL-ADD-RTN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF4-EN.

       FIFTH-SUBJECT-RTN.
           READ SUBJECT-IN.
           IF SUBJECT-CODE = 'COMP 2000 '
               PERFORM ENROLL-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF5-EN.
               PERFORM FIFTH-COMP-RTN UNTIL EOF5-EN = 'YES'.
               WRITE ENROLL-OUT FROM BLNK-HDR.
               WRITE ENROLL-OUT FROM ENROLL-TOTAL-NUM.
               WRITE ENROLL-OUT FROM BLNK-HDR.
       FIFTH-COMP-RTN.
           IF CODE-SUBJECT = SUBJECT-CODE
               PERFORM ENROLL-ADD-RTN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF5-EN.

       SIXTH-SUBJECT-RTN.
           READ SUBJECT-IN.
           IF SUBJECT-CODE = 'IT 2003      '
               PERFORM ENROLL-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF6-EN.
               PERFORM SIXTH-COMP-RTN UNTIL EOF6-EN = 'YES'.
               WRITE ENROLL-OUT FROM BLNK-HDR.
               WRITE ENROLL-OUT FROM ENROLL-TOTAL-NUM.
               WRITE ENROLL-OUT FROM BLNK-HDR.
       SIXTH-COMP-RTN.
           IF CODE-SUBJECT = SUBJECT-CODE
               PERFORM ENROLL-ADD-RTN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF6-EN.

       SEVENTH-SUBJECT-RTN.
           READ SUBJECT-IN.
           IF SUBJECT-CODE = 'MATH 1000 '
               PERFORM ENROLL-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF7-EN.
               PERFORM SEVENTH-COMP-RTN UNTIL EOF7-EN = 'YES'.
               WRITE ENROLL-OUT FROM BLNK-HDR.
               WRITE ENROLL-OUT FROM ENROLL-TOTAL-NUM.
               WRITE ENROLL-OUT FROM BLNK-HDR.
       SEVENTH-COMP-RTN.
           IF CODE-SUBJECT = SUBJECT-CODE
               PERFORM ENROLL-ADD-RTN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF7-EN.

       FOOTER-IN-RTN.
           WRITE ENROLL-OUT FROM BLNK-HDR.
           WRITE ENROLL-OUT FROM ENROLL-GRANDTOTAL-NUM.

       GRADES-WRITE-HEADER2.
           WRITE GRADES-OUT FROM HEADER1-ENROLL.
           WRITE GRADES-OUT FROM HEADER2-ENROLL.
           WRITE GRADES-OUT FROM BLNK-HDR AFTER 2.
           WRITE GRADES-OUT FROM HEADER4-ENROLL.
           WRITE GRADES-OUT FROM BLNK-HDR AFTER 2.

       GRADE-MOVE-RTN.
               MOVE CODE-OF-SUBJECT TO SUB-CODE.
               MOVE ID-OF-FACULTY TO ID-FACULTY.
               MOVE NAME-OF-FACULTY TO NAME-FACULTY.
               WRITE GRADES-OUT FROM HEADER1-GRADES.
               WRITE GRADES-OUT FROM HEADER2-GRADES.
               WRITE GRADES-OUT FROM HEADER3-GRADES.
               WRITE GRADES-OUT FROM HEADER4-GRADES.

       GRADE-COMPUTE-RTN.
           IF SUBJECTCODE = SUB-CODE AND FACULTYID = ID-FACULTY AND
               STUD-NUMBER = NO-OF-STUDENT
               COMPUTE AVERAGE-GRD = (MID-GRADE + FIN-GRADE) / 2
               MOVE AVERAGE-GRD TO AVERAGE-GRADE.

       FIRST-GRADE-RTN.
           READ FACULTY-IN.
           IF CODE-OF-SUBJECT = 'COMP 2000 ' AND
               ID-OF-FACULTY = '67890          '
               PERFORM GRADE-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF1-GRADES.
               READ GRADE-IN.
               PERFORM FIRST-GRADE-COMP-RTN UNTIL EOF1-GRADES = 'YES'.
               WRITE GRADES-OUT FROM BLNK-HDR.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-PASS.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-FAIL.
               WRITE GRADES-OUT FROM BLNK-HDR.
       FIRST-GRADE-COMP-RTN.
           IF CODE-SUBJECT = SUB-CODE AND FACULTY-ID = ID-FACULTY
               MOVE STUDENT-NUM TO NO-OF-STUDENT
               MOVE STUDENT-NAME TO NA-OF-STUDENT
               PERFORM FIRST-GRADE-IN-RTN UNTIL EOF2-GRADES = 'NO'
               PERFORM FIRST-GRADE-BREAK
               OPEN INPUT GRADE-IN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF1-GRADES.
       FIRST-GRADE-IN-RTN.
           PERFORM GRADE-COMPUTE-RTN.
               IF AVERAGE-GRD <= 3.12
                   MOVE 'PASSED ' TO REMARK
                   ADD 1 TO STUDENT1-PASS
               ELSE
                   MOVE 'FAILED ' TO REMARK
                   ADD 1 TO STUDENT1-FAIL.
           READ GRADE-IN AT END MOVE 'NO' TO EOF2-GRADES.
       FIRST-GRADE-BREAK.
           MOVE STUDENT1-PASS TO TOTAL-NUM-PASS
           MOVE STUDENT1-FAIL TO TOTAL-NUM-FAIL.
           WRITE GRADES-OUT FROM GRADE-REC.
           CLOSE GRADE-IN.
           MOVE 'YES' TO EOF2-GRADES.


       SECOND-GRADE-RTN.
           READ FACULTY-IN.
           IF CODE-OF-SUBJECT = 'NATSCI 105' AND
               ID-OF-FACULTY = '12345       '
               PERFORM GRADE-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF3-GRADES.
               READ GRADE-IN.
               PERFORM SECOND-GRADE-COMP-RTN UNTIL EOF3-GRADES = 'YES'.
               WRITE GRADES-OUT FROM BLNK-HDR.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-PASS.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-FAIL.
               WRITE GRADES-OUT FROM BLNK-HDR.
       SECOND-GRADE-COMP-RTN.
           IF CODE-SUBJECT = SUB-CODE AND FACULTY-ID = ID-FACULTY
               MOVE STUDENT-NUM TO NO-OF-STUDENT
               MOVE STUDENT-NAME TO NA-OF-STUDENT
               PERFORM SECOND-GRADE-IN-RTN UNTIL EOF4-GRADES = 'NO'
               PERFORM SECOND-GRADE-BREAK
               OPEN INPUT GRADE-IN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF3-GRADES.
       SECOND-GRADE-IN-RTN.
           PERFORM GRADE-COMPUTE-RTN.
               IF AVERAGE-GRD <= 3.12
                   MOVE 'PASSED ' TO REMARK
                   ADD 1 TO STUDENT2-PASS
               ELSE
                   MOVE 'FAILED ' TO REMARK
                   ADD 1 TO STUDENT2-FAIL.
           READ GRADE-IN AT END MOVE 'NO' TO EOF4-GRADES.
       SECOND-GRADE-BREAK.
           MOVE STUDENT2-PASS TO TOTAL-NUM-PASS
           MOVE STUDENT2-FAIL TO TOTAL-NUM-FAIL.
           WRITE GRADES-OUT FROM GRADE-REC.
           CLOSE GRADE-IN.
           MOVE 'YES' TO EOF4-GRADES.

       THIRD-GRADE-RTN.
           READ FACULTY-IN.
           IF CODE-OF-SUBJECT = 'IT 2001   ' AND
               ID-OF-FACULTY = '34567       '
               PERFORM GRADE-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF5-GRADES.
               READ GRADE-IN.
               PERFORM THIRD-GRADE-COMP-RTN UNTIL EOF5-GRADES = 'YES'.
               WRITE GRADES-OUT FROM BLNK-HDR.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-PASS.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-FAIL.
               WRITE GRADES-OUT FROM BLNK-HDR.
       THIRD-GRADE-COMP-RTN.
           IF CODE-SUBJECT = SUB-CODE AND FACULTY-ID = ID-FACULTY
               MOVE STUDENT-NUM TO NO-OF-STUDENT
               MOVE STUDENT-NAME TO NA-OF-STUDENT
               PERFORM THIRD-GRADE-IN-RTN UNTIL EOF6-GRADES = 'NO'
               PERFORM THIRD-GRADE-BREAK
               OPEN INPUT GRADE-IN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF5-GRADES.
       THIRD-GRADE-IN-RTN.
           PERFORM GRADE-COMPUTE-RTN.
                   IF AVERAGE-GRD <= 3.12
                   MOVE 'PASSED ' TO REMARK
                   ADD 1 TO STUDENT3-PASS
               ELSE
                   MOVE 'FAILED ' TO REMARK
                   ADD 1 TO STUDENT3-FAIL.
           READ GRADE-IN AT END MOVE 'NO' TO EOF6-GRADES.
       THIRD-GRADE-BREAK.
           MOVE STUDENT3-PASS TO TOTAL-NUM-PASS
           MOVE STUDENT3-FAIL TO TOTAL-NUM-FAIL.
           WRITE GRADES-OUT FROM GRADE-REC.
           CLOSE GRADE-IN.
           MOVE 'YES' TO EOF6-GRADES.

       FOURTH-GRADE-RTN.
           READ FACULTY-IN.
           IF CODE-OF-SUBJECT = 'COMP 2000 ' AND
               ID-OF-FACULTY = '23456       '
               PERFORM GRADE-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF7-GRADES.
               READ GRADE-IN.
               PERFORM FOURTH-GRADE-COMP-RTN UNTIL EOF7-GRADES = 'YES'.
               WRITE GRADES-OUT FROM BLNK-HDR.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-PASS.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-FAIL.
               WRITE GRADES-OUT FROM BLNK-HDR.
       FOURTH-GRADE-COMP-RTN.
           IF CODE-SUBJECT = SUB-CODE AND FACULTY-ID = ID-FACULTY
               MOVE STUDENT-NUM TO NO-OF-STUDENT
               MOVE STUDENT-NAME TO NA-OF-STUDENT
               PERFORM FOURTH-GRADE-IN-RTN UNTIL EOF8-GRADES = 'NO'
               PERFORM FOURTH-GRADE-BREAK
               OPEN INPUT GRADE-IN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF7-GRADES.
       FOURTH-GRADE-IN-RTN.
           PERFORM GRADE-COMPUTE-RTN.
               IF AVERAGE-GRD <= 3.12
                   MOVE 'PASSED ' TO REMARK
                   ADD 1 TO STUDENT4-PASS
               ELSE
                   MOVE 'FAILED ' TO REMARK
                   ADD 1 TO STUDENT4-FAIL.
           READ GRADE-IN AT END MOVE 'NO' TO EOF8-GRADES.
       FOURTH-GRADE-BREAK.
           MOVE STUDENT4-PASS TO TOTAL-NUM-PASS
           MOVE STUDENT4-FAIL TO TOTAL-NUM-FAIL.
           WRITE GRADES-OUT FROM GRADE-REC.
           CLOSE GRADE-IN.
           MOVE 'YES' TO EOF8-GRADES.

       FIFTH-GRADE-RTN.
           READ FACULTY-IN.
           IF CODE-OF-SUBJECT = 'HIST 1000 ' AND
               ID-OF-FACULTY = '45678       '
               PERFORM GRADE-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF9-GRADES.
               READ GRADE-IN.
               PERFORM FIFTH-GRADE-COMP-RTN UNTIL EOF9-GRADES = 'YES'.
               WRITE GRADES-OUT FROM BLNK-HDR.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-PASS.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-FAIL.
               WRITE GRADES-OUT FROM BLNK-HDR.
       FIFTH-GRADE-COMP-RTN.
           IF CODE-SUBJECT = SUB-CODE AND FACULTY-ID = ID-FACULTY
               MOVE STUDENT-NUM TO NO-OF-STUDENT
               MOVE STUDENT-NAME TO NA-OF-STUDENT
               PERFORM FIFTH-GRADE-IN-RTN UNTIL EOF10-GRADES = 'NO'
               PERFORM FIFTH-GRADE-BREAK
               OPEN INPUT GRADE-IN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF9-GRADES.
       FIFTH-GRADE-IN-RTN.
           PERFORM GRADE-COMPUTE-RTN.
               IF AVERAGE-GRD <= 3.12
                   MOVE 'PASSED ' TO REMARK
                   ADD 1 TO STUDENT5-PASS
               ELSE
                   MOVE 'FAILED ' TO REMARK
                   ADD 1 TO STUDENT5-FAIL.
           READ GRADE-IN AT END MOVE 'NO' TO EOF10-GRADES.
       FIFTH-GRADE-BREAK.
           MOVE STUDENT5-PASS TO TOTAL-NUM-PASS
           MOVE STUDENT5-FAIL TO TOTAL-NUM-FAIL.
           WRITE GRADES-OUT FROM GRADE-REC.
           CLOSE GRADE-IN.
           MOVE 'YES' TO EOF10-GRADES.

       SIXTH-GRADE-RTN.
           READ FACULTY-IN.
           IF CODE-OF-SUBJECT = 'IT 2003   ' AND
               ID-OF-FACULTY = '56789       '
               PERFORM GRADE-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF11-GRADES.
               READ GRADE-IN.
               PERFORM SIXTH-GRADE-COMP-RTN UNTIL EOF11-GRADES = 'YES'.
               WRITE GRADES-OUT FROM BLNK-HDR.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-PASS.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-FAIL.
               WRITE GRADES-OUT FROM BLNK-HDR.
       SIXTH-GRADE-COMP-RTN.
           IF CODE-SUBJECT = SUB-CODE AND FACULTY-ID = ID-FACULTY
               MOVE STUDENT-NUM TO NO-OF-STUDENT
               MOVE STUDENT-NAME TO NA-OF-STUDENT
               PERFORM SIXTH-GRADE-IN-RTN UNTIL EOF12-GRADES = 'NO'
               PERFORM SIXTH-GRADE-BREAK
               OPEN INPUT GRADE-IN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF11-GRADES.
       SIXTH-GRADE-IN-RTN.
           PERFORM GRADE-COMPUTE-RTN.
               IF AVERAGE-GRD <= 3.12
                   MOVE 'PASSED ' TO REMARK
                   ADD 1 TO STUDENT6-PASS
               ELSE
                   MOVE 'FAILED ' TO REMARK.
                   ADD 1 TO STUDENT6-FAIL.
           READ GRADE-IN AT END MOVE 'NO' TO EOF12-GRADES.
       SIXTH-GRADE-BREAK.
           MOVE STUDENT6-PASS TO TOTAL-NUM-PASS.
           MOVE STUDENT6-FAIL TO TOTAL-NUM-FAIL.
           WRITE GRADES-OUT FROM GRADE-REC.
           CLOSE GRADE-IN.
           MOVE 'YES' TO EOF12-GRADES.

       SEVENTH-GRADE-RTN.
           READ FACULTY-IN.
           IF CODE-OF-SUBJECT = 'MATH 1000 ' AND
               ID-OF-FACULTY = '89012       '
               PERFORM GRADE-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF13-GRADES.
               READ GRADE-IN.
               PERFORM SEVENTH-GRADE-COMP-RTN UNTIL EOF13-GRADES = 'YES'.
               WRITE GRADES-OUT FROM BLNK-HDR.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-PASS.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-FAIL.
               WRITE GRADES-OUT FROM BLNK-HDR.
       SEVENTH-GRADE-COMP-RTN.
           IF CODE-SUBJECT = SUB-CODE AND FACULTY-ID = ID-FACULTY
               MOVE STUDENT-NUM TO NO-OF-STUDENT
               MOVE STUDENT-NAME TO NA-OF-STUDENT
               PERFORM SEVENTH-GRADE-IN-RTN UNTIL EOF14-GRADES = 'NO'
               PERFORM SEVENTH-GRADE-BREAK
               OPEN INPUT GRADE-IN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF13-GRADES.
       SEVENTH-GRADE-IN-RTN.
           PERFORM GRADE-COMPUTE-RTN.
               IF AVERAGE-GRD <= 3.12
                   MOVE 'PASSED ' TO REMARK
                   ADD 1 TO STUDENT7-PASS
               ELSE
                   MOVE 'FAILED ' TO REMARK
                   ADD 1 TO STUDENT7-FAIL.
           READ GRADE-IN AT END MOVE 'NO' TO EOF14-GRADES.
       SEVENTH-GRADE-BREAK.
           MOVE STUDENT7-PASS TO TOTAL-NUM-PASS
           MOVE STUDENT7-FAIL TO TOTAL-NUM-FAIL.
           WRITE GRADES-OUT FROM GRADE-REC.
           CLOSE GRADE-IN.
           MOVE 'YES' TO EOF14-GRADES.

       EIGHT-GRADE-RTN.
           READ FACULTY-IN.
           IF CODE-OF-SUBJECT = 'NATSCI 100' AND
               ID-OF-FACULTY = '12345       '
               PERFORM GRADE-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF15-GRADES.
               READ GRADE-IN.
               PERFORM EIGHT-GRADE-COMP-RTN UNTIL EOF15-GRADES = 'YES'.
               WRITE GRADES-OUT FROM BLNK-HDR.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-PASS.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-FAIL.
               WRITE GRADES-OUT FROM BLNK-HDR.
       EIGHT-GRADE-COMP-RTN.
           IF CODE-SUBJECT = SUB-CODE AND FACULTY-ID = ID-FACULTY
               MOVE STUDENT-NUM TO NO-OF-STUDENT
               MOVE STUDENT-NAME TO NA-OF-STUDENT
               PERFORM EIGHT-GRADE-IN-RTN UNTIL EOF16-GRADES = 'NO'
               PERFORM EIGHT-GRADE-BREAK
               OPEN INPUT GRADE-IN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF15-GRADES.
       EIGHT-GRADE-IN-RTN.
           PERFORM GRADE-COMPUTE-RTN.
               IF AVERAGE-GRD <= 3.12
                   MOVE 'PASSED ' TO REMARK
                   ADD 1 TO STUDENT8-PASS
               ELSE
                   MOVE 'FAILED ' TO REMARK
                   ADD 1 TO STUDENT8-FAIL.
           READ GRADE-IN AT END MOVE 'NO' TO EOF16-GRADES.
       EIGHT-GRADE-BREAK.
           MOVE STUDENT8-PASS TO TOTAL-NUM-PASS
           MOVE STUDENT8-FAIL TO TOTAL-NUM-FAIL.
           WRITE GRADES-OUT FROM GRADE-REC.
           CLOSE GRADE-IN.
           MOVE 'YES' TO EOF16-GRADES.

       NINTH-GRADE-RTN.
           READ FACULTY-IN.
           IF CODE-OF-SUBJECT = 'COMP 2000 ' AND
               ID-OF-FACULTY = '34567       '
               PERFORM GRADE-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF17-GRADES.
               READ GRADE-IN.
               PERFORM NINTH-GRADE-COMP-RTN UNTIL EOF17-GRADES = 'YES'.
               WRITE GRADES-OUT FROM BLNK-HDR.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-PASS.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-FAIL.
               WRITE GRADES-OUT FROM BLNK-HDR.
       NINTH-GRADE-COMP-RTN.
           IF CODE-SUBJECT = SUB-CODE AND FACULTY-ID = ID-FACULTY
               MOVE STUDENT-NUM TO NO-OF-STUDENT
               MOVE STUDENT-NAME TO NA-OF-STUDENT
               PERFORM NINTH-GRADE-IN-RTN UNTIL EOF18-GRADES = 'NO'
               PERFORM NINTH-GRADE-BREAK
               OPEN INPUT GRADE-IN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF17-GRADES.
       NINTH-GRADE-IN-RTN.
           PERFORM GRADE-COMPUTE-RTN.
               IF AVERAGE-GRD <= 3.12
                   MOVE 'PASSED ' TO REMARK
                   ADD 1 TO STUDENT9-PASS
               ELSE
                   MOVE 'FAILED ' TO REMARK
                   ADD 1 TO STUDENT9-FAIL.
           READ GRADE-IN AT END MOVE 'NO' TO EOF18-GRADES.
       NINTH-GRADE-BREAK.
           MOVE STUDENT9-PASS TO TOTAL-NUM-PASS
           MOVE STUDENT9-FAIL TO TOTAL-NUM-FAIL.
           WRITE GRADES-OUT FROM GRADE-REC.
           CLOSE GRADE-IN.
           MOVE 'YES' TO EOF18-GRADES.

       TENTH-GRADE-RTN.
           READ FACULTY-IN.
           IF CODE-OF-SUBJECT = 'IT 2001   ' AND
               ID-OF-FACULTY = '56789       '
               PERFORM GRADE-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF19-GRADES.
               READ GRADE-IN.
               PERFORM TENTH-GRADE-COMP-RTN UNTIL EOF19-GRADES = 'YES'.
               WRITE GRADES-OUT FROM BLNK-HDR.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-PASS.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-FAIL.
               WRITE GRADES-OUT FROM BLNK-HDR.
       TENTH-GRADE-COMP-RTN.
           IF CODE-SUBJECT = SUB-CODE AND FACULTY-ID = ID-FACULTY
               MOVE STUDENT-NUM TO NO-OF-STUDENT
               MOVE STUDENT-NAME TO NA-OF-STUDENT
               PERFORM TENTH-GRADE-IN-RTN UNTIL EOF20-GRADES = 'NO'
               PERFORM TENTH-GRADE-BREAK
               OPEN INPUT GRADE-IN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF19-GRADES.
       TENTH-GRADE-IN-RTN.
           PERFORM GRADE-COMPUTE-RTN.
               IF AVERAGE-GRD <= 3.12
                   MOVE 'PASSED ' TO REMARK
                   ADD 1 TO STUDENT10-PASS
               ELSE
                   MOVE 'FAILED ' TO REMARK
                   ADD 1 TO STUDENT10-FAIL.
           READ GRADE-IN AT END MOVE 'NO' TO EOF20-GRADES.
       TENTH-GRADE-BREAK.
           MOVE STUDENT10-PASS TO TOTAL-NUM-PASS
           MOVE STUDENT10-FAIL TO TOTAL-NUM-FAIL.
           WRITE GRADES-OUT FROM GRADE-REC.
           CLOSE GRADE-IN.
           MOVE 'YES' TO EOF20-GRADES.

       ELEVEN-GRADE-RTN.
           READ FACULTY-IN.
           IF CODE-OF-SUBJECT = 'MATH 1000 ' AND
               ID-OF-FACULTY = '78901       '
               PERFORM GRADE-MOVE-RTN.
               READ STUDENT-IN AT END MOVE 'YES' TO EOF21-GRADES.
               READ GRADE-IN.
               PERFORM ELEVEN-GRADE-COMP-RTN UNTIL EOF21-GRADES = 'YES'.
               WRITE GRADES-OUT FROM BLNK-HDR.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-PASS.
               WRITE GRADES-OUT FROM TOTAL-NUM-OF-FAIL.
               WRITE GRADES-OUT FROM BLNK-HDR.
       ELEVEN-GRADE-COMP-RTN.
           IF CODE-SUBJECT = SUB-CODE AND FACULTY-ID = ID-FACULTY
               MOVE STUDENT-NUM TO NO-OF-STUDENT
               MOVE STUDENT-NAME TO NA-OF-STUDENT
               PERFORM ELEVEN-GRADE-IN-RTN UNTIL EOF22-GRADES = 'NO'
               PERFORM ELEVEN-GRADE-BREAK
               OPEN INPUT GRADE-IN.
           READ STUDENT-IN AT END MOVE 'YES' TO EOF21-GRADES.
       ELEVEN-GRADE-IN-RTN.
           PERFORM GRADE-COMPUTE-RTN.
               IF AVERAGE-GRD <= 3.12
                   MOVE 'PASSED ' TO REMARK
                   ADD 1 TO STUDENT11-PASS
               ELSE
                   MOVE 'FAILED ' TO REMARK
                   ADD 1 TO STUDENT11-FAIL.
           READ GRADE-IN AT END MOVE 'NO' TO EOF22-GRADES.
       ELEVEN-GRADE-BREAK.
           MOVE STUDENT11-PASS TO TOTAL-NUM-PASS
           MOVE STUDENT11-FAIL TO TOTAL-NUM-FAIL.
           WRITE GRADES-OUT FROM GRADE-REC.
           CLOSE GRADE-IN.
           MOVE 'YES' TO EOF22-GRADES.
